// საჭიროა შევქმნათ აპლიკაცია რომელიც `Fetch User` ღილაკზე დაჭერით
// მოგცემს სასუალებას რომ წამოვიღოთ მომხმარებლის ინფორმაცია
// **https://randomuser.me/api** მოცემული მისამართიდან და მიღებული მონაცემები
//  დავხატოთ ინტერფეისში.
// ღილაკის დაჭერის შემდეგ უნდა იცვლებოდეს ასევე ინფორმაცია.

// დამატებითი დავალება
// აპლიკაციაში უნდა მქონდეს საშუალება ავირჩიო რამდენი მომხმარებლის ინფორმაცია წამოვიღო.

// უნდა შემეძლოს წამოვიღო მხოლოდ male ან female ან ორივე ერთად.

// წინასწარ მოვნიშნო რა მონაცემების წამოღება მინდა და შემდეგ წამოვიღო ყველა საჭირო მონაცემი
// მაგალითად წამოვიღო მხოლოდ მომხმარებლის სახელი, საცხოვრებელი ადგილი, იმეილი,ტელეფონის ნომერი და სურათი

// ინტერფეისში გვჭირდება რომ გამოვიტანოთ

// - ფოტო: `picture.medium` *როგორც სურათი*
// - ელ ფოსტა: `email` *როგორც ტექსტი*
// - ქალაქი: `location.city` *როგორც ტექსტი*
// - სრული სახელი: `name` *როგორც ტექსტი*
//  🔔 სახელი შეიცვას სამ მნიშნველობას საჭიროა მოცემული სამი სტრიგნი გადვაბათ ერთმანეთზე

// მაგ:

// ```json
// {
//   "name": {
//     "title": "Monsieur",
//     "first": "Josef",
//     "last": "Garnier"
//   }
// }
// ```
// უნდა გამოიტანოთ ინტერფეისში როგორც

// `Monsieur Josef Garnier`

// 🎨 ინტერფეისის სტილი შეგიძლიათ შექმნათ თქვენი გემოვნებით
